Revit 2027 API
BuiltInFailures.LinkFailures.CannotOpenLinkedFileServerNotFound Property
 Cannot open the linked model using Open and Unload because the plugin [name] cannot be accessed. Please check plugin [name], which has server Id [serverId]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotOpenLinkedFileServerNotFound { get; }
Public Shared ReadOnly Property CannotOpenLinkedFileServerNotFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotOpenLinkedFileServerNotFound {
	FailureDefinitionId^ get ();
}
static member CannotOpenLinkedFileServerNotFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace